duration1 = int(input("Введите количество секунд:  "))
a = duration1 % 60
print(f"{a} секунд")
duration2 = int(input("Введите количество секунд:  "))
a = duration2 % 3600  # остаток от "часов"
b1 = a // 60  # кол-во минут
b2 = a % 60  # кол-во от секунд
print(f"{b1} минут(ы/а), {b2} секунд(ы/а)")
duration3 = int(input("Введите количество секунд:  "))
a = duration3 % 86400  # остаток от дней
b = a // 3600  # кол-во часов
b1 = (a % 3600) // 60  # кол-во минут
b2 = (a % 3600) % 60  # кол-во секунд
print(f"{b} час(а/ов), {b1} минут(ы/а), {b2} секунд(ы/а)")
duration4 = int(input("Введите количество секунд:  "))  # до месяца
a = duration4 % 2678400  # если в месяце кол-во дней = 31
c = a // 86400  # кол-во дней
b = (a % 86400) // 3600  # кол-во часов
b1 = ((a % 86400) % 3600) // 60  # кол-во минут
b2 = ((a % 86400) % 3600) % 60  # кол-во секунд
print(f"{c} дня(нь/ей), {b} час(а/ов), {b1} минут(ы/а), {b2} секунд(ы/а)")
duration5 = int(input("Введите количество секунд:  "))  # до года
a = duration5 % 31536000
k = a // 2678400  # кол-во месяцов
c = (a % 2678400) // 86400  # кол-во дней
b = ((a % 2678400) % 86400) // 3600  # кол-во часов
b1 = (((a % 2678400) % 86400) % 3600) // 60  # кол-во минут
b2 = (((a % 2678400) % 86400) % 3600) % 60  # кол-во секунд
print(f"{k}месяц(а/ов), {c} дня(нь/ей), {b} час(а/ов), {b1} минут(ы/а), {b2} секунд(ы/а)")
duration6 = int(input("Введите количество секунд:  "))  # свыше года (0_0)
a = duration5 // 31536000 # кол-во годов
k = (a % 31536000) // 2678400  # кол-во месяцов
c = ((a % 31536000) % 2678400) // 86400  # кол-во дней
b = (((a % 31536000) % 2678400) % 86400) // 3600  # кол-во часов
b1 = ((((a % 31536000) % 2678400) % 86400) % 3600) // 60  # кол-во минут
b2 = ((((a % 31536000) % 2678400) % 86400) % 3600) % 60  # кол-во секунд
print(f"{a} год(а/ов), {k}месяц(а/ов), {c} дня(нь/ей), {b} час(а/ов), {b1} минут(ы/а), {b2} секунд(ы/а)")
